
'''
代码的解释和执行过程
    a b两个函数, a函数中调用b, 后执行函数a
'''

# 1、案例1 只定义a, 不定义b, 语法就不通过
# def a():
#     print('a')
#     b()
# a()

# #2、案例2 先定义b, 后定义a, 最后执行a(被调用函数先定义,调用函数后定义,然后执行调用函数) 正常执行
# def b():
#     print('b')
#
# def a():
#     print('a')
#     b()
# a()
#
# # 3、案例3 先定义a, 后定义b, 最后执行a(调用函数先定义,被调用函数后定义，最后执行调用函数) 正常执行
# def a():
#     print('a')
#     b()
#
# def b():
#     print('b')
# a()

# 4、案例3 先定义a, 后执行a, 最后定义b(先定义调用函数，然后执行调用函数, 最后定义被调用函数后) 报错:NameError: name 'b' is not defined
# def a():
#     print('a')
#     b()
# a()
#
# def b():
#     print('b')
